# CIS-2266 Pandas dropbox
* Complete the exercise below
* Output completed notebook to HTML or PDF
* Upload to the Dropbox for grading

## Importing pandas

### Getting started and checking your pandas setup

Difficulty: *easy* 

**1.** Import pandas under the name `pd`. (1 point)

In [1]:
import  pandas as pd

**2.** Print the version of pandas that has been imported. (1 point)

In [2]:
pd.__version__

'0.24.2'

## DataFrame basics

### A few of the fundamental routines for selecting, sorting, adding and aggregating data in DataFrames

Difficulty: *easy*

Note: remember to import numpy using:
```python
import numpy as np
```

Consider the following Python dictionary `data` and Python list `labels`:

``` python
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
```
(This is just some meaningless data I made up with the theme of animals and trips to a vet.)

**3.** Create a DataFrame `df` from this dictionary `data` which has the index `labels`. (1 point)

In [22]:
#Use:
import numpy as np
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

# Code Goes Below:
df = pd.DataFrame(data, index=labels)

**4.** Display a summary of the basic information about this DataFrame and its data. (1 point)

In [4]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

**5.** Return the first 3 rows of the DataFrame `df`. (1 point)

In [5]:
df[0:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

**6.** Select just the 'animal' and 'age' columns from the DataFrame `df`. (1 point)

In [6]:
df[['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

**7.** Select the data in rows `[3, 4, 8]` *and* in columns `['animal', 'age']`. (1 point)

In [7]:
df.loc[df.index[[3,4,8]],['animal', 'age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

**8.** Select only the rows where the number of visits is greater than 3. (1 point)

In [8]:
df[df['visits'] > 3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

**9.** Select the rows where the age is missing, i.e. is `NaN`. (1 point)

In [9]:
df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

**10.** Select the rows where the animal is a cat *and* the age is less than 3. (1 point)

In [10]:
df[(df['animal'] == 'cat') & (df['age'] < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

**11.** Select the rows the age is between 2 and 4 (inclusive). (1 point)

In [11]:
df[df['age'].between(2,4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

**12.** Change the age in row 'f' to 1.5. (1 point)

In [12]:
df.loc['f', 'age'] = 1.5
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

**13.** Calculate the sum of all visits (the total number of visits). (1 point)

In [13]:
print("Total number of Visits =", df['visits'].sum())

Total number of Visits = 19

**14.** Calculate the mean age for each different animal in `df`. (1 point)

In [14]:
df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

**15.** Append a new row 'k' to `df` with your choice of values for each column. Then delete that row to return the original DataFrame. (1 point)

In [15]:
df.loc['k'] = [5.5, 'dog', 'no', 2]
# with new row k
df

  animal  age visits priority
a    cat  2.5      1      yes
b    cat    3      3      yes
c  snake  0.5      2       no
d    dog  NaN      3      yes
e    dog    5      2       no
f    cat  1.5      3       no
g  snake  4.5      1       no
h    cat  NaN      1      yes
i    dog    7      2       no
j    dog    3      1       no
k    5.5  dog     no        2

In [32]:
df = df.drop('k')
# without new row k
df

  animal  age visits priority
a    cat  2.5      1      yes
b    cat    3      3      yes
c  snake  0.5      2       no
d    dog  NaN      3      yes
e    dog    5      2       no
f    cat  1.5      3       no
g  snake  4.5      1       no
h    cat  NaN      1      yes
i    dog    7      2       no
j    dog    3      1       no

**16.** Count the number of each type of animal in `df`. (1 point)

In [16]:
df['animal'].value_counts()

dog      4
cat      4
snake    2
5.5      1
Name: animal, dtype: int64

**17.** Sort `df` first by the values in the 'age' in *decending* order, then by the value in the 'visit' column in *ascending* order. (1 point)

In [17]:
df.sort_values(by=['age', 'visits'], ascending=[False, True])

  animal  age visits priority
k    5.5  dog     no        2
i    dog    7      2       no
e    dog    5      2       no
g  snake  4.5      1       no
j    dog    3      1       no
b    cat    3      3      yes
a    cat  2.5      1      yes
f    cat  1.5      3       no
c  snake  0.5      2       no
h    cat  NaN      1      yes
d    dog  NaN      3      yes

**18.** The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be `True` and 'no' should be `False`. (1 point)

In [18]:
df['priority'] = df['priority'].map({'yes': True, 'no': False})

**19.** In the 'animal' column, change the 'snake' entries to 'python'. (1 point)

In [19]:
df['animal'] = df['animal'].replace('snake', 'python')

**20.** For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table). (1 point)

In [23]:
df.pivot_table(index='animal', columns='visits', values='age', aggfunc='mean')

visits    1    2    3
animal
cat     2.5  NaN  2.5
dog     3.0  6.0  NaN
snake   4.5  0.5  NaN

## DataFrames: beyond the basics

### Slightly trickier: you may need to combine two or more methods to get the right answer

Difficulty: *medium*

The previous section was tour through some basic but essential DataFrame operations. Below are some ways that you might need to cut your data, but for which there is no single "out of the box" method.

**21.** You have a DataFrame `df` with a column 'A' of integers. For example:
```python
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

How do you filter out rows which contain the same integer as the row immediately above? (2 points)

In [24]:
#Use:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})

#Code goes below:
df.loc[df['A'].shift() != df['A']]

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

**22.** Given a DataFrame of numeric values, say
```python
df = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values
```

how do you subtract the row mean from each element in the row? (2 points)

In [25]:
#Use:
df = pd.DataFrame(np.random.random(size=(5, 3)))

#Code goes below:
df.sub(df.mean(axis=1), axis=0)

          0         1         2
0 -0.050005  0.087291 -0.037286
1 -0.072291 -0.206476  0.278767
2 -0.321743 -0.179375  0.501118
3  0.012692 -0.078825  0.066133
4 -0.144059 -0.333891  0.477950

**23.** Suppose you have DataFrame with 10 columns of real numbers, for example:

```python
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
```
Which column of numbers has the smallest sum? (Find that column's label.) (2 points)

In [26]:
#Use:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))

#Code goes below:
df.sum().idxmin()

'd'

**24.** How do you count how many unique rows in DataFrame `df` (i.e. ignore all rows that are duplicates)? (2 points)

In [27]:
len(df.drop_duplicates(keep=False))

5

**25.** You have a DataFrame `df` that consists of 10 columns of floating--point numbers. Suppose that exactly 5 entries in each row are `NaN` values. 
1. For each row of the DataFrame, find the *column* which contains the *third* NaN value.

(You should return a Series of column labels.) (2 points)

In [28]:
print((df.isnull().cumsum(axis=1) == 3).idxmax(axis=1))

0    a
1    a
2    a
3    a
4    a
dtype: object

---

## DataFrames: harder problems (worth more points .. not extra credit, still max 30 points per assignment, however an opportunity to make-up extra points)

### These might require a bit of thinking outside the box...

...but all are solvable using just the usual pandas/NumPy methods (and so avoid using explicit `for` loops).

Difficulty: *hard*

**26.** Consider a DataFrame `df` where there is an integer column 'X':
```python
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})
```
For each value, count the difference back to the previous zero (or the start of the Series, whichever is closer). These values should therefore be `[1, 2, 0, 1, 2, 3, 4, 0, 1, 2]`. Make this a new column 'Y'. (3 points)

In [30]:
#Use:
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})

#Code goes below:
izero = np.r_[-1, (df['X'] == 0).to_numpy().nonzero()[0]] # indicies of zeros
idx = np.arange(len(df))
df['Y'] = idx - izero[np.searchsorted(izero - 1, idx) -1]
df

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

**27.** Consider a DataFrame containing rows and columns of purely numerical data. Create a list of the row-column index locations of the 3 largest values.   (3 points)

In [31]:
#Using
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})

#Code goes below
df.unstack().sort_values()[-3:].index.tolist()

[('X', 9), ('X', 6), ('X', 0)]

** END **